{
  "aboutMe": {
    "header": "About Me",
    "introLabel": "User Identification",
    "intro": "My name is Roya and I'm a front-end software engineer with a passion for creating engaging and functional web experiences. This portfolio is a reflection of what first made me fall in love with computers and serves as a small homage to those early sparks of curiosity and creativity.",
    "childhoodLabel": "System History:",
    "childhood": "As a 90s kid, I spent countless hours on the computer playing games like RollerCoaster Tycoon and drawing in Paint. I still remember how much I loved computer class in elementary school, especially the days when we were allowed to open Paint, create whatever we wanted, and take our drawings home on a floppy disk. Those moments stay with me, and that is why I knew I had to include them here.",
    "educationLabel": "Kernel Update:",
    "education": "I originally studied electrical engineering and went on to complete my master’s degree. Along the way, I discovered that what truly excited me was creating and working with visuals. I found myself drawn to building interfaces and bringing ideas to life on the screen, which eventually led me to front end development. I am largely self taught and genuinely enjoy learning, experimenting, and improving a little more every day.",
    "hobbiesLabel": "Background Processes",
    "hobbies": "Outside of coding, I enjoy reading, playing video games, working out (trying :D), listening to all kinds of music, taking photos, doing crafts like knitting (only scarves for now), and spending time with my cat Felix. I am naturally curious, positive, and always striving to improve both my technical and soft skills.",
    "thanksLabel": "Session Summary",
    "thanks": "Thank you for taking the time to look through my profile. I hope you enjoy exploring my work as much as I enjoy creating it!",
    "log": "*** Thread Status: Listening for Career Opportunities ***"
  },
  "contactMe": {
    "email": "Email",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "log": "*** Status: Online ***"
  },
  "data": {
    "myProjects": "C:\\My Projects",
    "aboutMe": "C:\\About Me",
    "contactMe": "C:\\Contact Me",
    "resume": "C:\\Resume.txt",
    "untitledPaint": "Untitled - Paint",
    "bin": "Recycle Bin",
    "player": "Vibes Player",
    "myComputer": "My Computer"
  },
  "introNotepad": {
    "hello": "Hello, World!",
    "roya": "I'm Roya Azemi",
    "frontend": "a Front-End Software Engineer",
    "maryland": "based in Maryland",
    "experience": "with 4+ years of experience.",
    "untitledNotepad": "Untitled - Notepad",
    "myName": "Roya Azemi",
    "browse": "Feel free to browse my desktop! :D"
  }
}
